#შექმენით 2 სია, ერთში იყოს მხოლოდ სტრინგ ტიპის ელემენტები, ხოლო მეორე სავსე იყოს ინტიჯერი მონაცემთა ტიპის ელემენტებით, რიცხვებით სავსე სიიდან, სტრინგებით სავსე სიაში ჩაამატე ის რიცხვები რომლებიც არიან 20-ზე მეტი და 50-ზე ნაკლები. გამოიყენეთ for ციკლი და შესაფერისი სიის ფუნქცია.

numbers = [3, 5, 6, 25, 37, 16, 42]

names = ["mate", "nika", "levani", "giorgi", "gegi", "sandro", "gigi"]

for i in range(len(numbers)):
    if numbers[i] > 20 and numbers[i] < 50:
        names.append(numbers[i])

print(names)


