#შექმენით არეული რიცხვებით სავსე გრძელი სია და 2 ცარიელი სია, ერთ სიაში ჩააგდეთ ყველა ის რიცხვი რომელიც არის ლუწი და დგას კენტ ინდექსზე, ხოლო მეორე სიაში ჩააგდეთ ყველა ის რიცხვი რომელიც არის კენტი და დგას ლუწ ინდექსზე, გამოიყენეთ for ციკლი.


numbers = [12, 7, 8, 3, 14, 9, 6, 5, 10, 20, 4, 12]


list1 = []

list2 = []


for i in range(len(numbers)):
    if i % 2 != 0 and numbers[i] % 2 == 0:
        list1.append(numbers[i])
    elif i % 2 == 0 and numbers[i] % 2 != 0:
        list2.append(numbers[i])

print(list1)
print(list2)

