# შექმენით გვარებით სავსე სია, თუ სიტყვის ყველა ასო არის პატარა, მაშინ ეს სიტყვა ამოშალეთ ამ სიიდან და თავიდან ჩაამატეთ იგივე სიაში, ოღონდ ერთი ინდექსით მარჯვნივ, და ყველა ასო ჰქონდეს დიდი. ხოლო თუ სიტყვის ყველა ასო არის დიდი, მაშინ ეს სიტყვა ამოშალეთ ამ სიიდან და თავიდან ჩაამატეთ იგივე სიაში, ოღონდ ერთი ინდექსით მარცხნივ, და ყველა ასო ჰქონდეს პატარა. იმუშავეთ ერთ სიაში, გამოიყენეთ while ციკლი.

surnames = ["modebadze", "xvedeLidze", "BITADZE" , "beridze", "Lomidze"]

i = 0

while i < len(surnames):
    if surnames[i] == surnames[i].lower():
        surnames.pop(i)
        surnames.insert(i + 1, surnames[i].upper())

        