#შექმენი ფუნქცია ერთი პარამეტრით — score.

#თუ ქულა ≥ 90 → დააბრუნოს "შესანიშნავი ქულა"

#თუ ქულა >= 70 და ნაკლებია ან <=89 → დააბრუნოს "კარგი ქულა"

#თუ ქულა >= 50 და <= 69 → დააბრუნოს "დამაკმაყოფილებელი ქულა"

#სხვა შემთხვევაში დააბრუნოს "ჩაჭრილი"

#გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით


def num(score):
    if score >= 90:
        return "შესანიშნავი ქულა"
    elif score >= 70:
        return "კარგი ქულა"
    elif score >= 50 and score <= 69:
        return "დამაკმაყოფილებელი ქულა"
    else:
        return "ჩაჭრილი"
    
print(num(34))
print(num(94))
print(num(65))
print(num(70))
    